{
  "+++x": 76,
  "+++y": 77,
  "+++z": 78,
  "++-x": 71,
  "++-y": 72,
  "++-z": 73,
  "++0x": 74,
  "++0y": 75,
  "+-+x": 63,
  "+-+y": 64,
  "+-+z": 65,
  "+--x": 58,
  "+--y": 59,
  "+--z": 60,
  "+-0x": 61,
  "+-0y": 62,
  "+0+x": 69,
  "+0+z": 70,
  "+0-x": 66,
  "+0-z": 67,
  "+00x": 68,
  "-++x": 43,
  "-++y": 44,
  "-++z": 45,
  "-+-x": 38,
  "-+-y": 39,
  "-+-z": 40,
  "-+0x": 41,
  "-+0y": 42,
  "--+x": 30,
  "--+y": 31,
  "--+z": 32,
  "---x": 25,
  "---y": 26,
  "---z": 27,
  "--0x": 28,
  "--0y": 29,
  "-0+x": 36,
  "-0+z": 37,
  "-0-x": 33,
  "-0-z": 34,
  "-00x": 35,
  "0++y": 56,
  "0++z": 57,
  "0+-y": 53,
  "0+-z": 54,
  "0+0y": 55,
  "0-+y": 49,
  "0-+z": 50,
  "0--y": 46,
  "0--z": 47,
  "0-0y": 48,
  "00+z": 52,
  "00-z": 51,
  "B": 22,
  "B'": 23,
  "B2": 24,
  "D": 10,
  "D'": 11,
  "D2": 12,
  "F": 19,
  "F'": 20,
  "F2": 21,
  "L": 13,
  "L'": 14,
  "L2": 15,
  "R": 16,
  "R'": 17,
  "R2": 18,
  "U": 7,
  "U'": 8,
  "U2": 9,
  "⬜": 1,
  "🟥": 5,
  "🟦": 4,
  "🟧": 6,
  "🟨": 2,
  "🟩": 3,
  "<|endoftext|>": 0
}